soap_publish_message_text.xml

<s:Envelope 
  xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
  xmlns:oh="urn:openhie.org:alerting"
  xmlns:wsa="http://www.w3.org/2005/08/addressing"

  >
  <s:Header>
    <wsa:Action soap:mustUnderstand="1" >urn:openhie.org:alerting:2014:Message</wsa:Action>
    <wsa:MessageID>urn:uuid:2c9597f0-4729-11e4-916c-0800200c9a66</wsa:MessageID> <!-- does this duplicate the oh:Message@id ?   -->
    <wsa:ReplyTo soap:mustUnderstand="1">
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address> 
    </wsa:ReplyTo>
    <wsa:To soap:mustUnderstand="1">http://host/alertbroker</wsa:To>
    <oh:IntendedRecipient>
      <oh:QueryTarget type="urn:ihe:iti:csd:2014:stored-function:facility-search">
        <csd:requestParams>
          <csd:codedType code="OPC" codingSchema="XXXXXX" />
          <csd:address>
            <csd:addressLine component="city">Chapel Hill</csd:addressLine>
          </csd:address>
        </csd:requestParams>
      </oh:QueryTarget>
      <oh:Target id='urn:ecid:1234'/>
    </oh:IntendedRecipient>
  </s:Header>
  <s:Body>
    <oh:Message 
	id='2c9597f0-4729-11e4-916c-0800200c9a66'
	published='2010-11-12T13:14:15Z'
	statusCode='Prioirity-Orange'  
	statusCodeScheme='CAPS-Example'	
	content-type='text/plan; charset=utf-8'
	xml:lang='en_US'
	>Hello World!</oh:Message>    
  </s:Body>

</s:Envelope>
